{
  "0": {
    "voice over": "You are Tony Stark, a billionare that is trapped in a cave by terrorist, you need to stay alive and find a way to escape. there is fire pit in front of you and a person is standing by the fire pit and he is talking",
    "NPC": "Yinsen: I won't move if I were you",
    "Player": {
        "voice": "What would you reply?  A: Can you help me?    B: What the hell did you do to me??",
        "reply": {
        "A": "1",
        "B": "2",
        "exit": "exit game"
      }
    }
  },
  "1": {
    "voice over": "Tony realizes that he is connected to a battery. He rips off the bandages over his chest to see an electromagnet in his chest",
    "NPC": "Yinsen: I removed all the shrapnel I could, but there's a lot left, and it's headed into your atrial septum. Here, want to see? [Pulls out a bottle of shrapnel.] I have a souvenir. Take a look. [Tosses the bottle to Tony] I've seen many wounds like that in my village. We call them the walking dead because it takes about a week for the barbs to reach the vital organs",
    "Player": {
      "voice": "I'm connected to a battery: A: Ask Yinsen what it is   B: Remove it from your body",
      "reply": {
        "A": "3",
        "B": "fail"
      }
    }
  },
  "2": {
    "voice over":"In shock to Tony's response, Yinsen turns away from Tony",
    "NPC":"Yinsen: You know I could be some help to you Tony, you should be more friendly",
    "Player": {
      "voice": "I'm connected to a battery: A: Ask Yinsen what it is   B: Remove it from your body",
      "reply": {
        "A": "3",
        "B": "fail"
      }
    }
  },
  "3": {
    "voice over": "Dazed and confused you begin to zip up your coat.",
    "NPC": "Yinsen: That is an electromagnet, hooked up to a car battery, and it's keeping the shrapnel from entering your heart. Hmm? That's right. Smile. We met once, you know, at a technical conference in Bern.",
    "voice over2": "Loud voices sound from the another side of the metal door as they open it.",
    "NPC2": "Yinsen: Come on, stand up. Stand up! Just do as I do. Come on, put your hands up",
    "Player":{
      "voice": "You notice the men with guys, the guns belong to you. What do you want to do: A: Stand up;  B: Remain seated \"",
      "reply": {
        "A": "4",
        "B": "fail"
      }
    }

  },
  "4": {
    "NPC": "Solider: Welcome, Tony Stark, the most famous mass murderer in the history of America, you will build a Jericho Missile for us, like the one you demostrated",
    "NPC2": "Yinsen: Tony, you must, they will kill us both",
    "voice over": "Tony begins to think of a plan, he gazes over to Yinsen,",
    "Player": {
      "voice": "What do you want to do: A: Agree to build Jericho Missile;  B: Refuse \"",
      "reply": {
        "A":"5",
        "B": "fail2"
      }
    }
  },
  "5": {
    "NPC": "Yinsen: I'm sure they're looking for you, Stark. But they will never find you in these mountains. Look, what you just saw, that is your legacy, Stark. Your life's work, in the hands of those murderers. Is that how you want to go out? Is this the last act of defiance of the great Tony Stark? Or are you going to do something about it?",
    "voice over": "Moving closer to the fire, Tony rubs his chest where the he thinks about his legacy",
    "Player": {
      "voice": "What will you do: A: Create a plan with Yinsen to escape B: Give up and build Jerchio missle",
      "reply": {
        "A": "6",
        "B": "fail"
      }
    }

  },
  "6": {
    "voice over": "Tony and Yinsen sit together by the fire, quietly going over there master plan to escape",
    "NPC": "Yinsen: Tony this is billant, Do you think you have the right materials?",
    "Player": {
      "voice": "Do you beleive you can build a Armored suit with weapons? A: I can build anything, I'm Tony Stark B: This plan will not work",
      "reply": {
        "A":"7",
        "B": "fail3"
      }
    }
  },
  "7": {
    "voice over": "As Tony and Yinsen discuss the plan, Tony starts to make a list of conpomtants to build the Armored suit",
    "NPC": "Yinesen: What is this?",
    "Player": {
      "voice": "This is our way out of here! A: Unroll drawings to show the plan B: Keep the plan a secret for now",
      "reply": {
        "A": "8",
        "B": "9"
      }
    }

  },

  "8": {
    "voice over": "As Tony and Yinsen begin to collect and discuss plans to escape footsteps are heard approaching",
    "NPC": "Yinesen: Quick roll up the plans, cover the materials",
    "NPC2": "Raza: Tony Stark!! Having you build my misslies will please the 10 Rings! Soon the whole world will bow before us.",
    "Player": {
      "voice": "Tony ponders his thoughts before replying A: What is the 10 Rings B: What are these missiles for?",
      "reply": {
        "A": "10",
        "B": "11"
      }
    }

  },
  "9": {
    "NPC": "Yinesen: Tony you must start trusting me for this plan to work!",
    "Player": {
      "voice": "You're right Yinesen I should start trusting you A: Show Yinsen the plans B: Tell Yinesesn he'll find out soon.",
      "reply": {
        "A": "8",
        "B": "8"
      }
    }
  },
  "10":{
    "NPC": "Raza: The 10 rings have been around before MANKIND!! We have inflitrated every body of you Americas pityful goverment; We are a organization of faith, you will soon see Tony",
    "Player": {
      "voice": "What are you planning? What are these missles for? A: Ask Raza what the missles are for B: What is the purpose of this?",
      "reply": {
        "A": "11",
        "B": "11"
      }
    }
  },
  "11": {
    "voice over": "As Raza contiues the story of the 10 rings Tony begins to reliaze how inportant his plan to esacpe is",
    "voice over2": "6 days later",
    "NPC": "Yinesen: Tony....Tony! We have did it! The suit is almost complete",
    "Player": {
      "voice": "This is it...we did it. Time to move to the next steps A: Try suit on B: Begin to plan the attack",
      "reply": {
      "A": "12",
      "B": "fail4"
      }
    }
  },
  "12": {
    "voice over": "With numbered days Raza and the 10 rings expect their weapons to be complete.",
    "NPC": "Raza: Tony Tony Tony, we must see these missles soon, our mission is approaching soon!!!",
    "NPC": "Yinesen: It's time! we must stop this now!!",
    "Player": {
      "voice": "It's time for some payback! A:Put Armored suit on and escape B:Hide scared from the fight",
      "reply": {
        "A": "13",
        "B": "fail5"
      }
    }
  },
  "13": {
    "voice over": "With time counting down, Tony and Yinesen begin to assembly the suit on Tony. Simultanesuly Raza sees somthing Suspicious on Camera, he send soilders to go check.",
    "NPC": "Yinesen: We must hurry we must complete the power sequence.It's loading, I'll but us more time!!",
    "voice over": "Yinesen grabs a weapon and begins firing. Keeping the eneimes back long enough for the suit to be ready.",
    "NPC": "Raza: What is this Tony? You think you can outsmart the 10 rings!?",
    "Player": {
      "voice": "Yea pal, I think I can! A: Use the Armored suit and lanch attack to escape B: Kill Raza and go save Yinesen.",
      "reply": {
        "A": "14",
        "B": "15"
      }
    }
  },
  "14": {
    "voice over": "The Battle begins! Tony shoots a missle towards Raza, The blast throws him. Tony starts towards Yinesen when a group of soliders start firing.",
    "NPC": "Solider: Give up Tony you'll never escape!",
    "Player": {
      "voice": "Lets see how you feel about this A: fire flame thrower at soliders B: Throw a haymaker at the solider.",
      "reply": {
        "A": "16",
        "B": "17"
      }
    }
  },
  "15": {
    "voice over": "The Battle begins! Tony shoots a missle towards Raza, The blast throws him. Tony starts towards Yinesen when a group of soliders start firing.",
    "NPC": "Solider: Give up Tony you'll never escape!",
    "Player": {
      "voice": "Lets see how you feel about this A: fire flame thrower at soliders B: Throw a haymaker at the solider.",
      "reply": {
        "A": "16",
        "B": "17"
      }
    }
  },
  "16": {
    "voice over": "Tony moves forward wondering through the cave searching for Yinesen.",
    "NPC": "Yinesen: Tony...Tony, I'm here",
    "voice over2": "As Tony approaches he sees Yinesen is mortialy wounded.",
    "NPC2": "Yinesen: Tony, I'm going to see my family, I want this. You have your life. Don't waste it...don't waste it.",
    "Player": {
      "voice": "Thank you for saving me. A: Begin to Assault your way out of the cave.",
      "reply": {
        "A": "17"
      }
    }
  },
  "17": {
    "voice over": "Yinsen dies. Tony turns angry. There are men waiting outside of the mouth of the cave. They all shoot at Tony in the suit, but don't do any damage",
    "Player": {
      "voice": "My turn!! A: Use Flamethrower B: Use metal arms and fist to attack.",
      "reply": {
        "A": "18",
        "B": "19"
      }
    }
  },
  "18": {
    "voice over":"Tony shoots fire at the men and their camp from his suit. The men continue to shoot at Tony, beginning to cause damage to the suit. Tony flips a suit and shoots up in the air. He screams as he falls into the sand on the other side of the mountains. The suit breaks when he lands.",
    "Player":{
      "voice": "Not bad at all. A: sit in the sand and take a break B: Attempt to put suit back together.",
      "reply": {
        "A": "20",
        "B": "21"
      }
    }
  },
  "19": {
    "voice over":"Tony shoots fire at the men and their camp from his suit. The men continue to shoot at Tony, beginning to cause damage to the suit. Tony flips a suit and shoots up in the air. He screams as he falls into the sand on the other side of the mountains. The suit breaks when he lands.",
    "Player":{
      "voice": "Not bad at all. A: sit in the sand and take a break B: Attempt to put suit back together.",
      "reply": {
        "A": "20",
        "B": "fail6"
      }
    }
  },
  "20": {
    "voice over": "Tony then is seen wondering through the desert, exhausted. Military helicopters fly up from behind him.",
    "Player": {
      "voice": "Oh damn who is this? A: Start waving down helicopters B: Hide in the sand.",
      "reply": {
        "A": "21",
        "B": "fail7"
      }
    }
  },
  "21": {
    "voice over": "As one of the helicopters lands, Tony collapses to his knees, holding up a peace sign. Rhodes and a few men are seen running up to Tony from the helicopter",
    "NPC": "James Rhodes: How was vaction? Next time you're riding with me",
    "Player": {
      "voice": " Took you long enough A: reach for Rhodes hand, It's time to go home",
      "reply": {
        "A": "22"
      }
    }
  },
  "22": {
    "voice over": "Now that Tony is home and safe he begins to realize he has a bigger purpose in life. As he gets ready for a press conference Rhodes begins to pressure to not tell anyone about the suit.",
    "NPC": "James Rhodes: Tony you just can't. Do you realize what this would look like in the public eye?",
    "Player": {
      "voice": "Listen Rhodes I have to change my legacy, I have to do something better for the name Stark. A: tell the world B: Keep it a secret.",
      "reply": {
        "A": "23",
        "B": "fail8"
      }
    }
  },
  "23": {
    "voice over": "I AM IRONMAN!!!"
  },
  "fail": {
    "voice over": "Game over, you have Died!!"
  },
  "fail2": {
    "voice over": "Game over, the soliders have killed you!!"
  },

  "fail3": {
    "voice over": "Tony completes missle, Then is killed by enemies, GAMEOVER!!"
  },
  "fail4": {
    "voice over": "Raza catches you trying on suit, Kills you both. GAME OVER!!!"
  },
  "fail5": {
    "voice over": "You have to fight back!! Game over"
  },
  "fail6": {
    "voice over": "The suit is unrepairable, The heat gets to Tony. He dies, GAME OVER!!"
  },
  "fail7": {
    "voice over": "The Helio is your only escape!! You can't surive the heat!! GAME OVER!!"
  },
  "fail8": {
    "voice over": "Do you want to be IRONMAN or not??? GAME OVER!!"
  }
}




